<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title><?= "Comparsion Operators"; ?></title>
</head>
<body>
    <?php
        // <, <=, >, >=

        // разница между == и === заключается в том что первый не сравнивает
        // типы, тоесть (5 == "5") == true

        // <> - работает аналогично оператору ==, но вместо буля возвращает число
        // в случае если числа равны возвращает 0
        // если левый операнд больше правого возвращает положительное число
        // если правый операнд больше левого возвращает отрицательное число
    ?>
</body>
</html>