<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title><?= "Math Operators"; ?></title>
</head>
<body>
    <?php
        // +, -, /, * - стандартные операции
        // ** - возведение в степень
        // % - взятие остатка с деления
        
        // if (!(n % 2)) - проверка делимости на 2
        // n ** 0.5 - корень квадратный из n

        // n++; - постфиксный инкремент/декремент, сначала возвращает значение,
        // потом увеличивает значение
        // ++n; - префиксный инкремент/декремент, сначала увеличивает значение,
        // потом возвращает значение (лучше использовать этот)
    ?>
</body>
</html>